In [10]:
import pandas as pd

In [11]:
number = pd.DataFrame(list(range(1,11)), columns=["Number"])
number

   Number
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9
9      10

In [12]:
# use copy to create a subset of data
# otherwise changes will apply to the original data

number_subset = number.iloc[2:5].copy()
number_subset

   Number
2       3
3       4
4       5

In [13]:
number_subset.iloc[0] = 1000

In [14]:
number

   Number
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9
9      10